app/controllers/health_concerns_controller.rb

SELECT  "user_carts".* FROM "user_carts" WHERE "user_carts"."user_id" = ? AND "user_carts"."product_id" = ? LIMIT ?  [["user_id", 1], ["product_id", 52], ["LIMIT", 1]]
DELETE FROM "user_carts" WHERE "user_carts"."id" = ?  [["id", 1]]
---
  def modify_cart
    begin
        p_id = params[:compny]
        user_cart_data = UserCart.where user_id: current_user.id
        item_remove = user_cart_data.find_by product_id: p_id
        item_remove.destroy

SELECT "user_carts".* FROM "user_carts" WHERE "user_carts"."user_id" = ?  [["user_id", 1]]
---
  def final_cart
    product_cart = UserCart.where user_id: current_user.id

SELECT  "product_lines".* FROM "product_lines" WHERE "product_lines"."Name" = ? LIMIT ?  [["Name", "Dairy"], ["LIMIT", 1]]
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_line_id" = ?  [["product_line_id", 5]]
---
  def product_category
      p_l = ProductLine.find_by Name: params[:product_line]
      product_catgory = ProductCategory.where product_line_id: p_l.id

SELECT  "product_categories".* FROM "product_categories" WHERE "product_categories"."Name" = ? LIMIT ?  [["Name", "Yogurt"], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."product_category_id" = ?  [["product_category_id", 15]]
---
 def company
      if params[:product_category] != nil
        p_l = ProductCategory.find_by Name: params[:product_category]
        session[:product_category] = p_l
        p_l_id = p_l["id"]
      else
        p_l = session[:product_category]
        p_l_id = p_l["id"]
      end
      produt_database=Product.where product_category_id: p_l_id

SELECT "health_concerns".* FROM "health_concerns" WHERE "health_concerns"."user_id" = ?  [["user_id", 1]]
---
      @Additional_Info =[]
      @id =[]
      len = produt_database.length
        user_cncern_list = HealthConcern.where user_id: current_user.id

SELECT "health_concern_maps".* FROM "health_concern_maps" WHERE "health_concern_maps"."product_category_id" = ?  [["product_category_id", 15]]
---
      elsif user_cncern_list[0].Kidney_Friendly ==1
        user_cncern = "Kidney_Friendly"
      end
      cncern_map = HealthConcernMap.where product_category_id: p_l_id