app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sankeerth@tamu.edu"], ["LIMIT", 1]]
---
  def create
    debugger
    user = User.find_by(email: params[:session][:Email].downcase)